## Terraform apply  [job](https://circleci.com/gh/fr123k/kube-hetzner/261) 377f2a72f62f563fafedcc3cbed47eb46ba3dc94 :x:

Error Summary:

```bash
Error: file provisioner error
```

<details>
    <summary>Show Details:</summary>

```bash

Initializing the backend...

Successfully configured the backend "http"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Reusing previous version of hetznercloud/hcloud from the dependency lock file
- Reusing previous version of hashicorp/random from the dependency lock file
- Installing hashicorp/random v3.1.2...
- Installed hashicorp/random v3.1.2 (signed by HashiCorp)
- Installing hetznercloud/hcloud v1.33.1...
- Installed hetznercloud/hcloud v1.33.1 (signed by a HashiCorp partner, key ID 5219EACB3A77198B)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # hcloud_firewall.k3s will be created
  + resource "hcloud_firewall" "k3s" {
      + id     = (known after apply)
      + labels = (known after apply)
      + name   = "k3s-firewall"

      + rule {
          + destination_ips = []
          + direction       = "in"
          + protocol        = "icmp"
          + source_ips      = [
              + "10.0.0.0/8",
              + "127.0.0.1/32",
              + "169.254.169.254/32",
              + "213.239.246.1/32",
            ]
        }
      + rule {
          + destination_ips = []
          + direction       = "in"
          + protocol        = "icmp"
          + source_ips      = [
              + "49.12.195.5/32",
            ]
        }
      + rule {
          + destination_ips = []
          + direction       = "in"
          + port            = "22"
          + protocol        = "tcp"
          + source_ips      = [
              + "49.12.195.5/32",
            ]
        }
      + rule {
          + destination_ips = []
          + direction       = "in"
          + port            = "6443"
          + protocol        = "tcp"
          + source_ips      = [
              + "49.12.195.5/32",
            ]
        }
      + rule {
          + destination_ips = []
          + direction       = "in"
          + port            = "any"
          + protocol        = "tcp"
          + source_ips      = [
              + "10.0.0.0/8",
              + "127.0.0.1/32",
              + "169.254.169.254/32",
              + "213.239.246.1/32",
            ]
        }
      + rule {
          + destination_ips = []
          + direction       = "in"
          + port            = "any"
          + protocol        = "udp"
          + source_ips      = [
              + "10.0.0.0/8",
              + "127.0.0.1/32",
              + "169.254.169.254/32",
              + "213.239.246.1/32",
            ]
        }
    }

  # hcloud_network.k3s will be created
  + resource "hcloud_network" "k3s" {
      + delete_protection = false
      + id                = (known after apply)
      + ip_range          = "10.0.0.0/16"
      + name              = "k3s-net"
    }

  # hcloud_network_subnet.k3s will be created
  + resource "hcloud_network_subnet" "k3s" {
      + gateway      = (known after apply)
      + id           = (known after apply)
      + ip_range     = "10.0.0.0/24"
      + network_id   = (known after apply)
      + network_zone = "eu-central"
      + type         = "cloud"
    }

  # hcloud_server.agents[0] will be created
  + resource "hcloud_server" "agents" {
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = (known after apply)
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "ubuntu-20.04"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + labels                     = {
          + "engine"      = "k3s"
          + "k3s_upgrade" = "true"
          + "provisioner" = "terraform"
        }
      + location                   = "nbg1"
      + name                       = "k3s-agent-0"
      + rebuild_protection         = false
      + rescue                     = "linux64"
      + server_type                = "cx21"
      + ssh_keys                   = (known after apply)
      + status                     = (known after apply)

      + network {
          + alias_ips   = []
          + ip          = "10.0.0.4"
          + mac_address = (known after apply)
          + network_id  = (known after apply)
        }
    }

  # hcloud_server.agents[1] will be created
  + resource "hcloud_server" "agents" {
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = (known after apply)
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "ubuntu-20.04"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + labels                     = {
          + "engine"      = "k3s"
          + "k3s_upgrade" = "true"
          + "provisioner" = "terraform"
        }
      + location                   = "nbg1"
      + name                       = "k3s-agent-1"
      + rebuild_protection         = false
      + rescue                     = "linux64"
      + server_type                = "cx21"
      + ssh_keys                   = (known after apply)
      + status                     = (known after apply)

      + network {
          + alias_ips   = []
          + ip          = "10.0.0.5"
          + mac_address = (known after apply)
          + network_id  = (known after apply)
        }
    }

  # hcloud_server.control_planes[0] will be created
  + resource "hcloud_server" "control_planes" {
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = (known after apply)
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "ubuntu-20.04"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + labels                     = {
          + "engine"      = "k3s"
          + "k3s_upgrade" = "true"
          + "provisioner" = "terraform"
        }
      + location                   = "nbg1"
      + name                       = "k3s-control-plane-1"
      + rebuild_protection         = false
      + server_type                = "cx11"
      + ssh_keys                   = (known after apply)
      + status                     = (known after apply)

      + network {
          + alias_ips   = []
          + ip          = "10.0.0.3"
          + mac_address = (known after apply)
          + network_id  = (known after apply)
        }
    }

  # hcloud_server.first_control_plane will be created
  + resource "hcloud_server" "first_control_plane" {
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = (known after apply)
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "ubuntu-20.04"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + labels                     = {
          + "engine"      = "k3s"
          + "provisioner" = "terraform"
        }
      + location                   = "nbg1"
      + name                       = "k3s-control-plane-0"
      + rebuild_protection         = false
      + rescue                     = "linux64"
      + server_type                = "cx11"
      + ssh_keys                   = (known after apply)
      + status                     = (known after apply)

      + network {
          + alias_ips   = []
          + ip          = "10.0.0.2"
          + mac_address = (known after apply)
          + network_id  = (known after apply)
        }
    }

  # hcloud_ssh_key.default will be created
  + resource "hcloud_ssh_key" "default" {
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + name        = "K3S terraform module - Provisioning SSH key"
      + public_key  = "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIOuWQiFiQ+zwMZHY+Ry2fYh7a3o8LBPCf0GlTV2SIoQD fr12_k@yahoo.com"
    }

  # random_password.k3s_token will be created
  + resource "random_password" "k3s_token" {
      + id          = (known after apply)
      + length      = 48
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + agents_public_ip        = [
      + (known after apply),
      + (known after apply),
    ]
  + controlplanes_public_ip = [
      + (known after apply),
      + (known after apply),
    ]
hcloud_ssh_key.default: Creating...
hcloud_network.k3s: Creating...
random_password.k3s_token: Creating...
random_password.k3s_token: Creation complete after 0s [id=none]
hcloud_firewall.k3s: Creating...
hcloud_network.k3s: Creation complete after 1s [id=1578390]
hcloud_network_subnet.k3s: Creating...
hcloud_ssh_key.default: Creation complete after 1s [id=6213371]
hcloud_firewall.k3s: Creation complete after 1s [id=370868]
hcloud_network_subnet.k3s: Creation complete after 1s [id=1578390-10.0.0.0/24]
hcloud_server.first_control_plane: Creating...
hcloud_server.first_control_plane: Still creating... [10s elapsed]
hcloud_server.first_control_plane: Provisioning with 'file'...
hcloud_server.first_control_plane: Still creating... [20s elapsed]
hcloud_server.first_control_plane: Still creating... [30s elapsed]
hcloud_server.first_control_plane: Still creating... [40s elapsed]
hcloud_server.first_control_plane: Still creating... [50s elapsed]
hcloud_server.first_control_plane: Still creating... [1m0s elapsed]
hcloud_server.first_control_plane: Still creating... [1m10s elapsed]
hcloud_server.first_control_plane: Still creating... [1m20s elapsed]
hcloud_server.first_control_plane: Still creating... [1m30s elapsed]
hcloud_server.first_control_plane: Still creating... [1m40s elapsed]
hcloud_server.first_control_plane: Still creating... [1m50s elapsed]
hcloud_server.first_control_plane: Still creating... [2m0s elapsed]
hcloud_server.first_control_plane: Still creating... [2m10s elapsed]
hcloud_server.first_control_plane: Still creating... [2m20s elapsed]
hcloud_server.first_control_plane: Still creating... [2m30s elapsed]
hcloud_server.first_control_plane: Still creating... [2m40s elapsed]
hcloud_server.first_control_plane: Still creating... [2m50s elapsed]
hcloud_server.first_control_plane: Still creating... [3m0s elapsed]
hcloud_server.first_control_plane: Still creating... [3m10s elapsed]
hcloud_server.first_control_plane: Still creating... [3m20s elapsed]
hcloud_server.first_control_plane: Still creating... [3m30s elapsed]
hcloud_server.first_control_plane: Still creating... [3m40s elapsed]
hcloud_server.first_control_plane: Still creating... [3m50s elapsed]
hcloud_server.first_control_plane: Still creating... [4m0s elapsed]
hcloud_server.first_control_plane: Still creating... [4m10s elapsed]
hcloud_server.first_control_plane: Still creating... [4m20s elapsed]
hcloud_server.first_control_plane: Still creating... [4m30s elapsed]
hcloud_server.first_control_plane: Still creating... [4m40s elapsed]
hcloud_server.first_control_plane: Still creating... [4m50s elapsed]
hcloud_server.first_control_plane: Still creating... [5m0s elapsed]
hcloud_server.first_control_plane: Still creating... [5m10s elapsed]

Error: file provisioner error

  with hcloud_server.first_control_plane,
  on master.tf line 16, in resource "hcloud_server" "first_control_plane":
  16:   provisioner "file" {

timeout - last error: dial tcp 116.203.71.138:22: i/o timeout
Releasing state lock. This may take a few moments...

```
</details>

<!-- github-comment: {"JobID":"a76d5018-901d-4cf3-a89f-c25cb8a05127","JobName":"terraform-apply","SHA1":"377f2a72f62f563fafedcc3cbed47eb46ba3dc94","TemplateKey":"plan","Vars":{}} -->